# ApplyLightInfoRecord

## Description
Apply Light Info Record from a symbol to an object.

```pascal
PROCEDURE ApplyLightInfoRecord(
				hSymboL : HANDLE;
				hObject : HANDLE);
```

```python

def vs.ApplyLightInfoRecord(hSymboL, hObject):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hSymboL|HANDLE||
|hObject|HANDLE||

## Version
Availability: from Vectorworks 2013
## Category
* Spotlight